app/Controllers/DaftarApp.php

    public function index()
    {
        $data = [
            'title'     => 'Satuan Kerja Jakarta Selatan',
            'kecamatan' => $this->kecamatanModel->getKecamatan(),
            'kelurahan' => $this->kelurahanModel->getKelurahan(),
            'aplikasi'  => $this->aplikasiJakselModel->paginate(4),
            'pager'     => $this->aplikasiJakselModel->pager
        ];
---
SELECT *
FROM `kecamatan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `kecamatan`

    public function getApps()
    {
        $page = $this->request->getVar('page') ?? 1;
        $data['aplikasi'] = $this->aplikasiJakselModel->paginate(4, 'jaksel_app', $page);
---
SELECT *
FROM `jaksel_app`
 LIMIT 12, 4
SELECT COUNT(*) AS `numrows`
FROM `jaksel_app`