app/Controllers/DaftarApp.php

    public function getKecamatan()
    {
        $page = $this->request->getVar('page') ?? 1;
        $data = [
            'kecamatan' => $this->kecamatanModel->paginate(5, 'kecamatan', $page),
            'kelurahan' => $this->kelurahanModel->getKelurahan(),
            'pager'     => $this->kecamatanModel->pager
        ];
---
SELECT *
FROM `kecamatan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `kecamatan`

    public function getApps()
    {
        $page = $this->request->getVar('page') ?? 1;
        $data['aplikasi'] = $this->aplikasiJakselModel->paginate(100, 'jaksel_app', $page);
---
SELECT *
FROM `jaksel_app`
 LIMIT 100
SELECT COUNT(*) AS `numrows`
FROM `jaksel_app`