app/Models/aplikasiKecamatanModel.php

    public function getAplikasiKecamatan()
    {
        return $this->findAll();
---
SELECT *
FROM `aplikasi_kecamatan`

    public function getAplikasiKecamatanBySlug($slug)
    {
        return $this->where('slug_kecamatan', $slug)->findAll();
---
SELECT *
FROM `aplikasi_kecamatan`
WHERE `slug_kecamatan` = 'cilandak'