app/Models/instansiModel.php

    public function getInstansi()
    {
        return $this->findAll();
---
SELECT *
FROM `instansi`