app/Models/kecamatanModel.php

SELECT *
FROM `kecamatan`
---
    public function getKecamatan()
    {
        return $this->findAll();