app/Models/kelurahanModel.php

SELECT *
FROM `kelurahan`
---
    public function getKelurahan()
    {
        return $this->findAll();